# Combining data

In [1]:
import pandas as pd

Preapering dummy data

In [31]:
uber = pd.read_csv('nyc_uber_2014.csv')
uber.shape

(297, 5)

In [3]:
uber.head()

   Unnamed: 0         Date/Time      Lat      Lon    Base
0           0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1           1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2           2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3           3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4           4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [28]:
uber1 = uber[:99]
uber1.shape

(99, 5)

In [29]:
uber2 = uber[99:198]
uber2.shape

(99, 5)

In [30]:
uber3 = uber[198:]
uber3.shape

(99, 5)

In [23]:
uber1.to_csv('uber1.csv')
uber2.to_csv('uber2.csv')
uber3.to_csv('uber3.csv')

Combining rows of data

In [24]:
row_concat = pd.concat([uber1, uber2, uber3])

In [26]:
row_concat.shape

(297, 5)

In [27]:
row_concat.head()

   Unnamed: 0         Date/Time      Lat      Lon    Base
0           0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1           1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2           2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3           3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4           4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

#### Combining columns of data

Preapering dummy data

In [38]:
ebola = pd.read_csv('ebola.csv')
ebola_melt = pd.melt(ebola, id_vars=['Date', 'Day'], var_name='type_country', value_name='counts')
ebola_melt['str_split'] = ebola_melt.type_country.str.split('_')
ebola_melt['type'] = ebola_melt.str_split.str.get(0)
ebola_melt['country'] = ebola_melt.str_split.str.get(1)
type_country = ebola_melt[['type', 'country']]
ebola_melt = ebola_melt.drop(columns=['type', 'country'])
print(ebola_melt.head())
print(type_country.head())

         Date  Day  type_country  counts        str_split
0    1/5/2015  289  Cases_Guinea  2776.0  [Cases, Guinea]
1    1/4/2015  288  Cases_Guinea  2775.0  [Cases, Guinea]
2    1/3/2015  287  Cases_Guinea  2769.0  [Cases, Guinea]
3    1/2/2015  286  Cases_Guinea     NaN  [Cases, Guinea]
4  12/31/2014  284  Cases_Guinea  2730.0  [Cases, Guinea]
    type country
0  Cases  Guinea
1  Cases  Guinea
2  Cases  Guinea
3  Cases  Guinea
4  Cases  Guinea

combine

In [40]:
ebola_tidy = pd.concat([ebola_melt, type_country], axis=1)

In [41]:
ebola_tidy.head()

         Date  Day  type_country  counts        str_split   type country
0    1/5/2015  289  Cases_Guinea  2776.0  [Cases, Guinea]  Cases  Guinea
1    1/4/2015  288  Cases_Guinea  2775.0  [Cases, Guinea]  Cases  Guinea
2    1/3/2015  287  Cases_Guinea  2769.0  [Cases, Guinea]  Cases  Guinea
3    1/2/2015  286  Cases_Guinea     NaN  [Cases, Guinea]  Cases  Guinea
4  12/31/2014  284  Cases_Guinea  2730.0  [Cases, Guinea]  Cases  Guinea

### Globbing
Finding files that match a pattern

In [42]:
import glob

In [43]:
pattern = '*.csv'
csv_files = glob.glob(pattern)
print(csv_files)

['airquality.csv', 'dob_job_application_filings_subset.csv', 'ebola.csv', 'nyc_uber_2014.csv', 'tb.csv', 'uber1.csv', 'uber2.csv', 'uber3.csv']

In [46]:
csv_third = pd.read_csv(csv_files[2])
csv_third.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN

Iterating and concatenating all matches

In [50]:
pattern = 'uber*.csv'
csv_files = glob.glob(pattern)
frames = []
for csv in csv_files:
    df = pd.read_csv(csv)
    frames.append(df)
# Concatenate frames into single DataFrame
uber = pd.concat(frames)
print(uber.shape)
print(uber.head())

(297, 6)
   Unnamed: 0  Unnamed: 0.1         Date/Time      Lat      Lon    Base
0           0             0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1           1             1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2           2             2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3           3             3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4           4             4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

### Merge Data

For three data sets: visited, site and survey

`new_data_frame = pd.merge(left=site, right=visited, left_on='name', right_on='site')`

`m2m = pd.merge(left=m2m, right=survey, left_on='ident', right_on='taken')`